<template>
  <div>
    <el-button @click="visible = true">点击</el-button>
    <popup :visible.sync="visible" :draggable="true" :elprops="elprops">
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
      很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容很多内容
    </popup>
  </div>
</template>

<script>
import popup from '@/components/base/popup';

export default {
  components: { popup },
  data() {
    return {
      visible: false,
      elprops: {
        title: '标题提提',
      },
    };
  },
};
</script>

<style>
</style>
